{
  "posts": [
    {
      "id": 1,
      "nom": "nsir",
      "prenom": "dorra",
      "photo": "assets/images/avatar6.jpg",
      "blogPost": "Image to Text Converter\nOnline Image to text converter converts any image into editable text. We have developed this tool using OCR (Optical Character Recognition).Tesseract and other Python libraries are used to refine the extracted text.\n\nBelow are some of the best features that out stands our tool"
    },
    {
      "id": 2,
      "nom": "nsir",
      "prenom": "dorra",
      "photo": "assets/images/avatar5.jpg",
      "blogPost": "aa"
    },
    {
      "id": 3,
      "nom": "Mootez",
      "prenom": "Aouinti",
      "photo": "assets/images/avatar5.jpg",
      "blogPost": "Love is a set of emotions and behaviors characterized by intimacy, passion, and commitment. It involves care, closeness, protectiveness, attraction, affection, and trust.\n\nLove can vary in intensity and can change over time. It is associated with a range of positive emotions, including happiness, excitement, life satisfaction, and euphoria, but it can also result in negative emotions such as jealousy and stress.1\n\nWhen it comes to love, some people would say it is one of the most important human emotions. Yet despite being one of the most studied behaviors, it is still the least understood. For example, researchers debate whether love is a biological or cultural phenomenon.2\n\nLove is most likely influenced by both biology and culture. Although hormones and biology are important, the way we express and experience love is also influenced by our personal conceptions of love.\n\n 5 Psychological Theories of Love\nHow Do You Know You're Feeling Love for Someone?\nWhat are some of the signs of love? Researchers have made distinctions between feelings of liking and loving another person.\n\nZick Rubin's Scales of Liking and Loving\nAccording to psychologist Zick Rubin, romantic love is made up of three elements:3\n\nAttachment: Needing to be with another person and desiring physical contact and approval\nCaring: Valuing the other person's happiness and needs as much as your own\nIntimacy: Sharing private thoughts, feelings, and desires with the other person\nBased on this view of romantic love, Rubin developed two questionnaires to measure these variables, known as Rubin's Scales of Liking and Loving. Whereas people tend to view people they like as pleasant, love is marked by being devoted, possessive, and confiding in one another. \n\n Am I in Love? Take the Quiz\nTypes of Love\nNot all forms of love are the same, and psychologists have identified a number of different types of love that people may experience.1\n\nThese types of love include:\n\nFriendship: This type of love involves liking someone and sharing a certain degree of intimacy.\nInfatuation: This is a form of love that often involves intense feelings of attraction without a sense of commitment; it often takes place early in a relationship and may deepen into a more lasting love.\nPassionate love: This type of love is marked by intense feelings of longing and attraction; it often involves an idealization of the other person and a need to maintain constant physical closeness.\nCompassionate/companionate love: This form of love is marked by trust, affection, intimacy, and commitment.\nUnrequited love: This form of love happens when one person loves another who does not return those feelings.\n Twin Flame: Soulmate's Lesser-Known Cousin\nRobert Sternberg's Triangular Theory of Love\nSpecifically, psychologist Robert Sternberg developed his well-regarded triangular theory of love in the early 1980s.4 Much research has built upon his work and demonstrated its universality across cultures.4\n\nSternberg broke love into three components—intimacy, passion, and commitment—that interact to produce seven types of love"
    },
    {
      "id": 4,
      "nom": "samiraaaaaaaaa",
      "prenom": "Ben ahmd",
      "photo": "assets/images/avatar6.jpg",
      "blogPost": "Have you ever been wondering what part of speech the articles belong to? Do you think they are pronouns, adverbs or adjectives? Well, this article will help you with all that you need to know. Learn what articles are, their definition, types, how to use them, and uses, along with examples. Also, try out the practice questions given to check how far you have understood the same.\n\nTable of Contents\nWhat is an Article?\nDefinition of an Article\nTypes of Articles in English\nDefinite Article\nIndefinite Article\nUsage and Exceptions – Points to be Remembered When Using Articles\nExamples of Articles\nCheck Your Understanding of Articles\nFrequently Asked Questions on Articles in English Grammar\nWhat is an Article?\nAn article is a short monosyllabic word that is used to define if the noun is specific or not. Articles are normally used before nouns and since they are used to speak about the noun, they can be considered as adjectives.\n\nLook at how various dictionaries define an article to have a much clearer idea of what they are.\n\nDefinition of an Article\nAn article, according to the Merriam-Webster Dictionary, is defined as “any of a small set of words or affixes (such as a, an, and the) used with nouns to limit or give definiteness to the application.” According to the Collins Dictionary, “an article is a kind of determiner. In English, ‘a’ and ‘an’ are called the indefinite article, and ‘the’ is called the definite article.” The Macmillan Dictionary defines an article as “a type of determiner (=word used before a noun) that shows whether you are referring to a particular thing or to a general example of something. The indefinite article is ‘a’ or ‘an’ and the definite article is ‘the’.”\n\nTypes of Articles\nThere are three articles in English – ‘a’, ‘an’ and ‘the’. These articles are divided into two types namely:\n\nDefinite Article\nIndefinite Article\nDefinite Article\nAmong the three articles, ‘the’ is said to be the definite article. A definite article is used to determine something that is specific or particular. It is also used before plural nouns and to indicate the superlative degree of comparison. Furthermore, it can be used before collective nouns as well.\n\nFor example:\n\nThe Sun sets in the west.\nIn the above sentence, the nouns ‘Sun’ and ‘west’ are proper nouns and are specific and so the definite article has to be used.\n\nThe children are playing cricket.\nIn the above sentence, the definite article is used to determine the plural noun, ‘children’.\n\nThis is the world’s longest river.\nIn the above sentence, the definite article is used to denote the superlative degree of comparison.\n\nThe crowd sang along with the band.\nIn the above sentence, the definite article is used before the collective nouns, ‘crowd’ and ‘band’.\n\nIndefinite Article\nThe articles ‘an’ and ‘an’ are termed as indefinite articles. An indefinite article, as the name suggests, is used to indicate something that is not definite or specific. It can also be used before singular nouns.\n\nAmong the indefinite articles, ‘an’ is used before singular nouns that start with vowel sounds and ‘a’ is used before singular nouns that begin with consonant sounds.\n\nFor example:\n\nI had an apple for breakfast.\nDo you have an eraser?\nI saw an aeroplane.\nShe has a pet dog.\nMy father is a doctor.\nMy brother gave me a calculator."
    },
    {
      "id": 5,
      "nom": "ali baba",
      "prenom": "saleh",
      "photo": "assets/images/",
      "blogPost": "salm 3alykom"
    },
    {
      "id": 6,
      "nom": "MALEKEE",
      "prenom": "HAZEM",
      "photo": "assets/images/avatar1.jpg",
      "blogPost": "GGGGGGGGGGGGGGGGGGG"
    },
    {
      "id": 7,
      "nom": "rawend",
      "prenom": "trabilsi",
      "photo": "assets/images/avatar4.jpg",
      "blogPost": "hhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhh"
    },
    {
      "id": 8,
      "nom": "MMMMMMMMM",
      "prenom": "GGGGGGGGGGG",
      "photo": "assets/images/avatar4.jpg",
      "blogPost": "GGGGGGGGGGGGGGG"
    }
  ],
  "comments": [],
  "profile": {
    "fullname": "dorra",
    "email": "dorransir24@gmail.com",
    "password": "azerty"
  }
}